import { Component } from '@angular/core';
import * as FileSaver from 'file-saver';
import { saveAs } from 'file-saver';

@Component({
	selector: 'app-faq',
	templateUrl: './faq.component.html',
	styleUrls: [ './faq.component.scss' ]
})
export class FaqComponent {
	public categoryIndex: number = 0;

	public categories: Category[] = [
		new Category(
			'شروع کار',
			'این وبسایت امکان رهگیری موارد تخلف مالیاتی و پولشویی را برای شما فراهم می‌کند.',
			'gettingStarted',
			[
				new Item(
					'چگونه وارد اکانتمان شویم؟',
					'با استفاده از دکمه ورود واقع شده در صفحه اصلی می‌توانید به صفحه ورود بروید. سپس با وارد کردن شناسه کاربری و رمز عبور می‌توانید وارد سایت بشوید.'
				),
				new Item(
					'چگونه حساب بانکی مورد نظرمان را پیدا کنیم؟',
					' با استفاده از دکمه جستجو وارد بخش جستجو می‌شوید. حال می‌توانید بوسیله شناسه‌های مختلف حساب از جمله نام صاحب حساب و ... می‌توانید حساب مورد نظرتان را جستجو کرده و پیدا کنید'
				),
				new Item(
					'چگونه حساب بانکی را وارد صفحه گراف کنیم؟',
					'با استفاده از دکمه + که پس از جستجوی حساب برای هر حساب قرار می‌گیرد می‌توانید حساب مورد نظرتان را به صفحه اضافه کنید.'
				),
				new Item(
					'چگونه جزییات حساب را ببینیم؟',
					' در صورتی که حسابتان روی صفحه باشد می‌توانید با نگه داشتن دکمه shift و کلیک روی حساب مورد نظر جزییات آن را ببینید. همچنین در صفحه نتایج جستجو نیز می‌توانید دکمه i را برای این منظور انتخاب کنید.'
				),
				new Item(
					'چگونه با صفحه گراف کار کنیم؟',
					'برای این منظور به بخش گراف یا آموزش ویدیویی مراجعه فرمایید.'
				)
			]
		),
		new Category(
			'گراف',
			'برای کار با حساب مشتریان می‌بایست آن ها را وارد صفحه گراف کنید. وبسایت ما قابلیت تشخیص تحلفات را از روی گراف به شما می‌دهد.',
			'graphCat',
			[
				new Item(
					'با اکانت‌های (رئوس) داخل گراف چگونه کار کنم؟',
					'برای آنکه بتوانید ویژگی‌هایی که محصول ما در اختیار شما می‌گذارد تا بوسیله آن با اکانت‌ها کار کنید، کافیست روی هر اکانت یا راس بروید و راست کلیک نمایید. حال منویی باز می‌شود که امکانات مختلف را نشان می‌دهد'
				),
				new Item(
					'محصول شما چه ویژگی‌هایی را برای کار با حساب‌ها در اختیار ما قرار می‌دهد؟',
					'ویژگی‌هایی که در اختیار شما قرار می‌گیرد عبارتند از: گسترش راس، انتخاب مبدا، انتخاب مقصد، حذف راس و قفل کردن روی راس'
				),
				new Item(
					'گسترش راس چه کاری انجام می‌دهد؟',
					'برای آن‌که بتوانیم تراکنش‌های میان یک راس و بقیه رئوس را ببینیم، از این ویژگی استفاده می‌کنیم. پس از انتخاب آن، تمامی حساب‌هایی که با آن راس تراکنش داشته اند وارد صفحه گراف می‌شوند.'
				),
				new Item(
					'انتخاب مبدا و مقصد برای چه امری صورت می‌گیرد؟',
					'اگر بخواهید امکان تخلف بین دو حساب مشکوک را ببینید، می‌بایست حساب مبدا و مقصد را انتخاب کنید. حال زبانه‌ای از بالای صفحه برای شما باز می‌شود و می‌توانید با انتخاب حداکثر طول مسیر تراکنش بین این دو حساب امکان تخلف را بررسی کنید.'
				),
				new Item(
					'چگونه امکان تخلف را بررسی کنیم؟',
					'پس از انتخاب مبدا و مقصد، زبانه‌ای که بالای صفحه برای شما باز می‌شود را انتخاب کنید. حال حداکثر طول مسیر تراکنشی بین دو حساب را وارد نمایید. این مقدار بیش از ۷ نمی‌تواند باشد زیرا در صورت بیشتر شدن مسیر از عدد ۷ امکان تخلف به شدت کاهش می‌یابد. حال با انتخاب دکمه محاسبه، کلیه مسیر های مورد نظر بین دو حساب وارد گراف می‌شوند و گراف اصلی حذف می‌شود. و در نهایت میزان جریان مالی نیز نمایش داده می‌شود که با کمک آن می‌توانید امکان رخ دادن تخلف را بررسی کنید.'
				),
				new Item(
					'قفل کردن راس به چه معناست؟',
					'گاهی می‌خواهید یک حساب مشخص داخل گراف دچار تغییرات مکانی نشود و باقی راس‌ها را بر اساس آن بچینید. برای این منظور روی آن قفل می‌کنید. اگر بخواهید می‌توانید از طریق منو، راس مورد نظر را از حالت قفل خارج کنید.'
				)
			]
		)
	];

	public click = (index: number) => (this.categoryIndex = index);
}

class Category {
	public constructor(
		public title: string,
		public subtitle: string,
		public icon: string,
		public items: Item[]
	) {}
}

class Item {
	public constructor(
		public question: string,
		public answer: string,
		public show: boolean = false
	) {}
}
